Repository: oveleon/contao-component-style-manager
Catalog: contao/languages/*/*_style_manager_import.xlf
Languages: de

# tl_style_manager_import.bundleConfig
source: Bundle configurations
de: Bundle-Konfigurationen

# tl_style_manager_import.bundleConfigEmpty
source: No configurations available
de: Keine Konfigurationen vorhanden

# tl_style_manager_import.bundleConfigInactive
source: The bundle configuration has been disabled for this project. To have configurations of other bundles imported, you have to activate them first.
de: Die Bundle-Konfiguration wurde für dieses Projekt ausgeschaltet. Um Konfigurationen anderer Bundles importieren zu lassen, müssen Sie diese vorerst aktivieren.

# tl_style_manager_import.files
source: Files
de: Dateien

# tl_style_manager_import.import
source: Import
de: Importieren

# tl_style_manager_import.importPartial
source: Import parts
de: Teilimport

# tl_style_manager_import.importPartialDesc
source: Allows you to select the records to import before importing.
de: Ermöglicht die Auswahl der zu importierenden Datensätze vor dem Import.

# tl_style_manager_import.importManual
source: Manual import
de: Manueller Import

# tl_style_manager_import.importExplanation
source: Select the records that you want to import.
de: Wählen Sie hier die Datensätze aus, welche importiert werden sollen.

# tl_style_manager_import.uploadFile
source: Here you can upload one .xml file to be imported.
de: Hier können Sie eine .xml-Datei für den Import hochladen.
