Repository: oveleon/contao-component-style-manager
Catalog: contao/languages/*/*_style_manager_archive.xlf
Languages: de, fr

# tl_style_manager_archive.title_legend
source: Title
de: Titel
fr: Intitulé

# tl_style_manager_archive.config_legend
source: Config
de: Konfiguration
fr: Configuration

# tl_style_manager_archive.new.0
source: Add category
de: Neue Kategorie
fr: Ajouter une catégorie

# tl_style_manager_archive.new.1
source: Create new category
de: Neue Kategorie erstellen.
fr: Créer une nouvelle catégorie

# tl_style_manager_archive.import.0
source: Import
de: Importieren
fr: Importer

# tl_style_manager_archive.import.1
source: Import a config
de: Konfiguration importieren
fr: Importer une configuration

# tl_style_manager_archive.config.0
source: Configurations
de: Konfigurationen

# tl_style_manager_archive.config.1
source: Import a config
de: Konfiguration importieren
fr: Importer la configuration

# tl_style_manager_archive.export.0
source: Export
de: Exportieren
fr: Exporter

# tl_style_manager_archive.export.1
source: Export a config
de: Konfiguration exportieren
fr: Exporter une configuration

# tl_style_manager_archive.editheader.0
source: Edit category
de: Kategorie bearbeiten
fr: Éditer la catégorie

# tl_style_manager_archive.editheader.1
source: Edit category
de: Kategorie bearbeiten
fr: Éditer la catégorie

# tl_style_manager_archive.edit.0
source: Edit group
de: Gruppe bearbeiten
fr: Éditer le groupe

# tl_style_manager_archive.edit.1
source: Edit group
de: Gruppe bearbeiten
fr: Éditer le groupe

# tl_style_manager_archive.copy.0
source: Copy category
de: Kategorie kopieren
fr: Copier la catégorie

# tl_style_manager_archive.copy.1
source: Copy category
de: Kategorie kopieren
fr: Copier la catégorie

# tl_style_manager_archive.delete.0
source: Delete category
de: Kategorie löschen
fr: Supprimer la catégorie

# tl_style_manager_archive.delete.1
source: Delete category
de: Kategorie löschen
fr: Supprimer la catégorie

# tl_style_manager_archive.show.0
source: Show category info
de: Kategorieinformatinoen anzeigen
fr: Afficher les informations de la catégorie

# tl_style_manager_archive.show.1
source: Show category info
de: Kategorieinformatinoen anzeigen
fr: Afficher les informations de la catégorie

# tl_style_manager_archive.title.0
source: Title
de: Titel
fr: Intitulé

# tl_style_manager_archive.title.1
source: Title or category name.
de: Titel oder Kategoriename.
fr: Intitulé ou nom de catégorie.

# tl_style_manager_archive.desc.0
source: Description
de: Beschreibung

# tl_style_manager_archive.desc.1
source: Here you can enter a description for your CSS groups contained in this category. The description is displayed above the fields.
de: Hier kannst du eine Beschreibung für deine in dieser Kategorie enthaltenen CSS-Gruppen hinterlegen. Die Beschreibung wird oberhalb der Felder angezeigt.
fr: Vous pouvez indiquer une description pour vos groupes CSS contenus dans cette catégorie. La description est affichée au dessus des champs.

# tl_style_manager_archive.identifier.0
source: Identifier
de: Kennung
fr: Identifiant

# tl_style_manager_archive.identifier.1
source: The identifier is used to receive the group classes if they is passed to the template. (e.g. $this->styleManager->get('myCategoryIdentifier')
de: Die Kennung dient zum Entgegennehmen der Gruppenklassen, sofern diese an das Template übergeben werden. (Bspw. $this->styleManager->get('meineKategorieKennung')

# tl_style_manager_archive.groupAlias.0
source: Group-Identifier
de: Gruppenkennung
fr: Identifiant de groupe

# tl_style_manager_archive.groupAlias.1
source: The group identifier is used to group categories together. Categories with identical group identifier are displayed in the backend as one section with several tabs.
de: Die Gruppenkennung dient zum zusammenfassen von Kategorien. Kategorien mit identischer Gruppenkennung werden im Backend als einen Abschntt mit mehreren Tabs dargestellt.
fr: L'identifiant de groupe est utilisé pour grouper les catégories. Les catégories avec le même identifiant de groupe vont être afficher dans le back-office comme une seule section avec plusieurs onglets.

# tl_style_manager_archive.sorting.0
source: Sort-Index
de: Sortierindex
fr: Ordre de tri

# tl_style_manager_archive.sorting.1
source: Enter a freely definable number here to define the sort index. This is used to determine the order of the categories in the backend.
de: Geben Sie hier eine frei definierbare Zahl ein, um den Sortierindex zu definieren. Dieser dient dazu, die Reihenfolge der Kategorien im Backend zu bestimmen.
fr: Indiquez un nombre libre pour définir l'ordre de tri. Il est utilisé pour déterminer l'ordre des catégories dans le back-office.

# tl_style_manager_archive.bundleConfig.0.0
source: About the bundle configuration
de: Über die Bundle-Konfiguration
fr: À propos de la configuration du bundle

# tl_style_manager_archive.bundleConfig.0.1
source: Bundle configurations are used to automatically consume and use StyleManager properties from other bundles.
de: Bundle-Konfigurationen dienen dazu, automatisiert StyleManager-Eigentschaften aus anderen Bundles zu konsumieren und verwenden zu können.
fr: Les configurations de bundle servent à consommer et à pouvoir utiliser de manière automatisée les propriétés StyleManager d'autres bundles.

# tl_style_manager_archive.bundleConfig.1.0
source: Overwrite configuration
de: Konfiguration überschreiben
fr: Remplacer la configuration

# tl_style_manager_archive.bundleConfig.1.1
source: If you import the configurations into the system using the Import button, properties with the same identifiers (category) and aliases (CSS group) will be added / overwritten. If you delete these properties later, the original configuration will be used again.
de: Sofern Sie die Bundle-Konfigurationen über den Import-Button in das System importieren, werden Eigenschaften mit denselben Kennungen (Kategorie) und Aliasse (CSS-Gruppe) ergänzt / überschrieben. Beim nachträglichen Löschen dieser Eigenschaften wird die Original-Konfiguration wieder verwendet.
fr: Dans la mesure où vous importez les configurations de bundle dans le système via le bouton d'importation, les propriétés sont complétées / écrasées par les mêmes identifiants (catégorie) et alias (groupe CSS). En cas de suppression ultérieure de ces propriétés, la configuration d'origine sera à nouveau utilisée.

# tl_style_manager_archive.bundleConfig.2.0
source: Switch on / off
de: Ein- / Ausschalten
fr: Mise en marche / arrêt

# tl_style_manager_archive.bundleConfig.2.1
source: Automatic reading of bundle configurations can be switched off via config.yaml: <br/><br/> <pre> contao_component_style_manager: use_bundle_config: false </pre>
de: Das automatische Einlesen von Bundle-Konfigurationen kann über die config.yaml ausgeschaltet werden: <br/><br/> <pre> contao_component_style_manager: use_bundle_config: false </pre>
fr: La lecture automatique des configurations de bundle peut être désactivée via le fichier config.yaml: <br/><br/> <pre> contao_component_style_manager: use_bundle_config: false </pre>

# tl_style_manager_archive.identifier.1
source: The identifier is used to receive the group classes if they is passed to the template. (e.g. $this->styleManager->get('myCategoryIdentifier'))
fr: L'identifiant est utilisé pour récupérer le groupe de classes s'ils sont passés au modèle. (ex. $this->styleManager->get('myCategoryIdentifier'))
