Repository: oveleon/contao-component-style-manager
Catalog: contao/languages/*/*_style_manager.xlf
Languages: de, fr

# tl_style_manager.title_legend
source: Title
de: Titel
fr: Intitulé

# tl_style_manager.config_legend
source: Configuration
de: Konfiguration

# tl_style_manager.publish_legend
source: Publishing
de: Veröffentlichung
fr: Publications

# tl_style_manager.expert_legend
source: Expert settings
de: Experteneinstellungen
fr: Paramètres expert

# tl_style_manager.ow_key
source: CSS Class
de: CSS-Klasse
fr: Classes CSS

# tl_style_manager.ow_value
source: Title / Description
de: Titel / Beschreibung
fr: Intitulé / Description

# tl_style_manager.noStylesDefined
source: No styles are defined for this area.
de: Für diesen Bereich sind keine Stile hinterlegt.
fr: Pas de styles définis pour cette zone.

# tl_style_manager.new.0
source: New css group
de: Neue CSS-Gruppe
fr: Nouveau groupe css

# tl_style_manager.new.1
source: Create a new css group.
de: Neue CSS-Gruppe erstellen.
fr: Créer un nouveau groupe css.

# tl_style_manager.edit.0
source: Edit group
de: Gruppe bearbeiten

# tl_style_manager.edit.1
source: Edit group
de: Gruppe bearbeiten

# tl_style_manager.copy.0
source: Copy group
de: Gruppe kopieren
fr: Copier le groupe

# tl_style_manager.copy.1
source: Copy group
de: Gruppe kopieren
fr: Copier le groupe

# tl_style_manager.delete.0
source: Delete group
de: Gruppe löschen
fr: Supprimer le groupe

# tl_style_manager.delete.1
source: Delete group
de: Gruppe löschen
fr: Supprimer le groupe

# tl_style_manager.show.0
source: Show group info
de: Gruppeinformationen anzeigen
fr: Afficher les informations du groupe

# tl_style_manager.show.1
source: Show group info
de: Gruppeinformationen anzeigen
fr: Afficher les informations du groupe

# tl_style_manager.title.0
source: Title
de: Titel
fr: Intitulé

# tl_style_manager.title.1
source: Title or group name of the statements.
de: Titel oder Gruppenname der Anweisungen.
fr: Intitulé ou nom de groupe pour ces déclarations.

# tl_style_manager.description.0
source: Description
de: Beschreibung

# tl_style_manager.description.1
source: Here you can enter a field description.
de: Hier können Sie eine Feldbeschreibung eingeben.
fr: Vous pouvez indiquer ici une description du champ.

# tl_style_manager.alias.1
source: Here you can define an alias which is needed to receive the selected CSS class of this group in templates. (For example $this->styleManager->get('myCategoryIdentifier', ['thisAlias']).
de: Hier können Sie einen Alias definieren, welcher benötigt wird, um die gewählte CSS-Klasse dieser Gruppe in Templates entgegennehmen zu können. (Bspw. $this->styleManager->get('myCategoryIdentifier', ['thisAlias'])).
fr: Vous pouvez définir ici l'alias qui sera nécessaire pour réceptionner les classes CSS sélectionnées pour ce groupe de modèles. (Par exemple $this->styleManager->get('myCategoryIdentifier', ['thisAlias']).

# tl_style_manager.cssClass.0
source: CSS class
de: CSS-Klasse
fr: Classes CSS

# tl_style_manager.cssClass.1
source: Here you can add custom classes to the backend field.
de: Hier können Sie dem Backend-Feld eigene Klassen hinzufügen.
fr: Vous pouvez ajouter ici des classes personnalisés au champ du back-office.

# tl_style_manager.chosen.0
source: Add search field
de: Suchfeld hinzufügen
fr: Ajout d'un champ de recherche

# tl_style_manager.chosen.1
source: Use of chosen for a search field within the select box.
de: Verwendung von chosen für ein Suchfeld innerhalb der Select-Box.
fr: Utilise chosen dans un champ de recherche d'une liste déroulante.

# tl_style_manager.blankOption.0
source: Include Blank Option
de: Leere Option hinzufügen
fr: Inclut une option vide

# tl_style_manager.blankOption.1
source: Adds an empty option to the widget. If this option is not selected, it is mandatory to choose one of the CSS classes. The first defined CSS class will be set as default.
de: Fügt dem Widget eine leere Option hinzu. Sollte diese Option nicht ausgewählt sein, muss zwingend eine der CSS-Klassen gewählt werden. Die erste definierte CSS-Klasse wird dabei als Standard gesetzt.
fr: Ajoute une option vide aux options. Si cette option n'est pas sélectionnée, il est obligatoire de choisir une des classes CSS. La première classe CSS définie sera celle définie par défaut.

# tl_style_manager.passToTemplate.0
source: Use as template variable
de: Als Templatevariable verwenden
fr: Utiliser comme variable de modèle

# tl_style_manager.passToTemplate.1
source: The selected class is not set directly, but is passed to the selected template and can be retrieved via the category identifier (e.g. $this->styleManager->get('myCategoryIdentifier'))
de: Die gewählte Klasse wird nicht direkt gesetzt, sondern an das gewählte Template übergeben und kann über die Kennung der Kategorie abgerufen werden (Bspw. $this->styleManager->get('meineKategorieKennung'))
fr: La classe sélectionnée ne sera pas définie directement mais sera passée au modèle sélectionné et pourra être récupérée via l'identifiant de catégorie (ex. $this->styleManager->get('myCategoryIdentifier'))

# tl_style_manager.cssClasses.0
source: CSS classes
de: CSS-Klassen
fr: Classes CSS

# tl_style_manager.cssClasses.1
source: Define the CSS classes and their descriptions that are available in this group.
de: Definieren Sie hier die in dieser Gruppe vorhandenen CSS-Klassen und deren Beschreibungen.
fr: Définissez des classes CSS et leurs descriptions disponibles dans ce groupe.

# tl_style_manager.extendLayout.1
source: Provides the CSS classes in layouts.
de: Stellt die CSS-Klassen in Layouts zur Verfügung.
fr: Rend accessible les classes CSS dans les présentations de page.

# tl_style_manager.extendPage.0
source: Pages
de: Seiten

# tl_style_manager.extendPage.1
source: Provides the CSS classes in pages.
de: Stellt die CSS-Klassen in Seiten zur Verfügung.
fr: Rend accessible les classes CSS dans les pages.

# tl_style_manager.extendArticle.0
source: Articles
de: Artikel

# tl_style_manager.extendArticle.1
source: Provides the CSS classes in articles.
de: Stellt die CSS-Klassen in Artikeln zur Verfügung.
fr: Rend accessible les classes CSS dans les articles.

# tl_style_manager.extendModule.0
source: Modules
de: Module

# tl_style_manager.extendModule.1
source: Provides the CSS classes in modules.
de: Stellt die CSS-Klassen in Modulen zur Verfügung.
fr: Rend accessible les classes CSS dans les modules.

# tl_style_manager.extendNews.0
source: News
de: Nachrichten
fr: Actualités

# tl_style_manager.extendNews.1
source: Provides the CSS classes in news.
de: Stellt die CSS-Klassen in Nachrichten zur Verfügung.
fr: Rend accessible les classes CSS dans les actualités.

# tl_style_manager.extendEvents.1
source: Provides the CSS classes in events.
de: Stellt die CSS-Klassen in Events zur Verfügung.
fr: Rend accessible les classes CSS dans les événements.

# tl_style_manager.extendForm.0
source: Forms
de: Formulare
fr: Formulaires

# tl_style_manager.extendForm.1
source: Provides the CSS classes in forms.
de: Stellt die CSS-Klassen in Formularen zur Verfügung.
fr: Rend accessible les classes CSS dans les formulaires.

# tl_style_manager.extendFormFields.0
source: Form fields
de: Formularfelder

# tl_style_manager.extendFormFields.1
source: Provides the CSS classes in form fields.
de: Stellt die CSS-Klassen in Formularfeldern zur Verfügung.
fr: Rend accessible les classes CSS dans les champs de formulaire.

# tl_style_manager.extendContentElement.0
source: Content elements
de: Inhaltselemente
fr: Éléments de contenu

# tl_style_manager.extendContentElement.1
source: Provides the CSS classes in content elements.
de: Stellt die CSS-Klassen in Inhaltselementen zur Verfügung.
fr: Rend accessible les classes CSS dans les éléments de contenu.

# tl_style_manager.contentElements.0
source: Available content elements
de: Verfügbare Inhaltselemente
fr: Éléments de contenu disponibles

# tl_style_manager.contentElements.1
source: Select the content elements that this group may be displayed for.
de: Wählen Sie die Inhaltselemente aus, für die diese Gruppe angezeigt werden soll.
fr: Sélectionnez les éléments de contenus que ce groupe peut afficher.

# tl_style_manager.formFields.0
source: Available form fields
de: Verfügbare Formularfelder
fr: Champs de formulaire disponibles

# tl_style_manager.formFields.1
source: Select the form fields that this group may be displayed for.
de: Wählen Sie die Formularfelder aus, für die diese Gruppe angezeigt werden soll.
fr: Sélectionnez les champs de formulaire que ce groupe peut afficher.

# tl_style_manager.modules.0
source: Available modules
de: Verfügbare Module
fr: Modules disponibles

# tl_style_manager.modules.1
source: Select the modules that this group may be displayed for.
de: Wählen Sie die Module aus, für die diese Gruppe angezeigt werden soll.
fr: Sélectionnez les modules que ce groupe peut afficher.

# tl_style_manager.editheader.0
source: Edit group
fr: Editer le groupe

# tl_style_manager.editheader.1
source: Edit group
fr: Editer le groupe

# tl_style_manager.extendLayout.0
source: Layouts
fr: Présentations de page

# tl_style_manager.extendEvents.0
source: Events
fr: Événements
